<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>AuthenticationMethod</key>
			<string>directory</string>
			<key>AutoJoin</key>
			<true/>
			<key>EAPClientConfiguration</key>
			<dict>
				<key>AcceptEAPTypes</key>
				<array>
					<integer>25</integer>
					<integer>17</integer>
				</array>
				<key>OneTimeUserPassword</key>
				<false/>
				<key>PayloadCertificateAnchorUUID</key>
				<array>
					<string>1FC905F1-D83C-4329-81C0-9F6FE629E302</string>
					<string>A7DB907F-396D-4DCA-8963-2CE24632F3CB</string>
				</array>
				<key>SystemModeCredentialsSource</key>
				<string>ActiveDirectory</string>
				<key>TLSTrustedServerNames</key>
				<array/>
				<key>TTLSInnerAuthentication</key>
				<string>MSCHAPv2</string>
			</dict>
			<key>EncryptionType</key>
			<string>Any</string>
			<key>HIDDEN_NETWORK</key>
			<false/>
			<key>Interface</key>
			<string>BuiltInWireless</string>
			<key>PayloadDisplayName</key>
			<string>WiFi (BISD-Secure)</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.011-ctemac2.bisd.k12.2d3da6b0-f6e6-0130-a545-002500eedaae.alacarte.interfaces.57a1e230-f6e6-0130-a547-002500eedaae</string>
			<key>PayloadType</key>
			<string>com.apple.wifi.managed</string>
			<key>PayloadUUID</key>
			<string>57a1e230-f6e6-0130-a547-002500eedaae</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>ProxyType</key>
			<string>None</string>
			<key>SSID_STR</key>
			<string>BISD-Secure</string>
			<key>SetupModes</key>
			<array>
				<string>System</string>
				<string>Loginwindow</string>
			</array>
		</dict>
		<dict>
			<key>PayloadCertificateFileName</key>
			<string>bisdacs1</string>
			<key>PayloadContent</key>
			<data>
			MIIB5jCCAU+gAwIBAgIFAJv9fCIwDQYJKoZIhvcNAQEFBQAwNzEQ
			MA4GA1UEChMHVW5rbm93bjEQMA4GA1UECxMHVW5rbm93bjERMA8G
			A1UEAxMIYmlzZGFjczEwHhcNMTMwNjI0MjAwMTMzWhcNMTkwNzIy
			MTcxMzAzWjA3MRAwDgYDVQQKEwdVbmtub3duMRAwDgYDVQQLEwdV
			bmtub3duMREwDwYDVQQDEwhiaXNkYWNzMTCBnzANBgkqhkiG9w0B
			AQEFAAOBjQAwgYkCgYEA0CU7ZiNAitP8Nv2/B4d14z8Ew3VIdYD5
			FgUFXODwrQJgT2UfgbDRfWVne55a6aXLnPQRLxKmWn44FKjCfeBI
			WHu0GOtN8TU+4XyJr4tKPt+YwM3miS0lpC285byVrrCUHdD0G6X1
			x4cgYyv6JX9CdRU87tMWd9Zl19Al40S7rk0CAwEAATANBgkqhkiG
			9w0BAQUFAAOBgQBmSfdLprWsJVB0QDb/RI6O8fxP2LvmgM4zIcZI
			cdNh5payQ9H11rPuW0EtnP3Cpac4IpFupJf8wFjyZrmmX25ZSDNM
			2piZE+Ls/F0N+Oa6TZm5O6tPky8nGG0pRfLftkTfwlx2dQU3KHjW
			Hgj/cJ2weo/pMvh5rHlNXeB8qnT+bA==
			</data>
			<key>PayloadDisplayName</key>
			<string>bisdacs1</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.011-ctemac2.bisd.k12.2d3da6b0-f6e6-0130-a545-002500eedaae.alacarte.certificate.569bad03-77fc-476b-a31b-3c7bf9519a42</string>
			<key>PayloadType</key>
			<string>com.apple.security.root</string>
			<key>PayloadUUID</key>
			<string>569bad03-77fc-476b-a31b-3c7bf9519a42</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>data_files</key>
			<array>
				<integer>5</integer>
			</array>
		</dict>
		<dict>
			<key>PayloadCertificateFileName</key>
			<string>bisdacs2</string>
			<key>PayloadContent</key>
			<data>
			MIIB5jCCAU+gAwIBAgIFAJwgbDwwDQYJKoZIhvcNAQEFBQAwNzEQ
			MA4GA1UEChMHVW5rbm93bjEQMA4GA1UECxMHVW5rbm93bjERMA8G
			A1UEAxMIYmlzZGFjczIwHhcNMTMwNzA4MTcyOTEwWhcNMTkwNzIy
			MTcxMzE3WjA3MRAwDgYDVQQKEwdVbmtub3duMRAwDgYDVQQLEwdV
			bmtub3duMREwDwYDVQQDEwhiaXNkYWNzMjCBnzANBgkqhkiG9w0B
			AQEFAAOBjQAwgYkCgYEA5+q2Mh1m4VdhlZ63tXlUHQsTLvuOUyxN
			VkbHjpuFZmOZyDkIL9wIb2A85IFy2+15pv/xwp1FX1wiokUBQ9PR
			b5KSOQsZmNJtomvVqw3dDnuZ9DDK26QMsgp/PPV9mohNLKKb0VY8
			h3pZCty4d3vhofC9AIXBH0708oOsNgexdjcCAwEAATANBgkqhkiG
			9w0BAQUFAAOBgQBePUXZZ9n0uuBu+rlJjPuae1YzzmgHomBjrqEE
			Dm79iaQXJiTSyJAWTE1cnXtIH0xbDegNf2bJNUna2Me+hSOoy9dd
			BJ4lnNupahnanybrfoywMvIPgqZwk5kT6w4u4hNVIpCuqAR8byld
			HscSaEZiMLwQpuAVOIoI4gAInhqsZw==
			</data>
			<key>PayloadDisplayName</key>
			<string>bisdacs2</string>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>com.apple.mdm.011-ctemac2.bisd.k12.2d3da6b0-f6e6-0130-a545-002500eedaae.alacarte.certificate.0c193fa9-1b21-4c4f-8137-8b282a9144ce</string>
			<key>PayloadType</key>
			<string>com.apple.security.root</string>
			<key>PayloadUUID</key>
			<string>0c193fa9-1b21-4c4f-8137-8b282a9144ce</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>data_files</key>
			<array>
				<integer>6</integer>
			</array>
		</dict>
	</array>
	<key>PayloadDisplayName</key>
	<string>BISD-Secure_System</string>
	<key>PayloadIdentifier</key>
	<string>BISD-Secure_System</string>
	<key>PayloadOrganization</key>
	<string>Birdville ISD</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadScope</key>
	<string>System</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>2d3da6b0-f6e6-0130-a545-002500eedaae</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
